#include "../include/hal_lksmcu_trim.h"
#include "stdint.h"
#include "lks32mc45x_user_manual.h"
#include "../include/hal_lksmcu_reg.h"
#include "../include/hal_lks32mc45x_reg.h"
#include "../include/hal_lksmcu_crc.h"
uint32_t HAL_TRIM_ReadMcu45(uint32_t);

// 地址 内容
// 0x00000800 SYS_AFE_REGC 校准值
// 0x00000804 SYS_AFE_REGD 校准值
// 0x00000808 SYS_AFE_REGE 校准值
// 0x0000080C SYS_AFE_REGF 校准值
// 0x00000810 SYS_AFE_REG10校准值
// 0x00000820 ADC0_DC0 校准值,2/3倍增益
// 0x00000824 ADC0_DC1 校准值,1倍增益
// 0x00000828 ADC0_AMC0 校准值,2/3倍增益
// 0x0000082C ADC0_AMC1 校准值,1倍增益
// 0x00000830 ADC1_DC0 校准值,2/3倍增益
// 0x00000834 ADC1_DC1 校准值,1倍增益
// 0x00000838 ADC1_AMC0 校准值,2/3倍增益
// 0x0000083C ADC1_AMC1 校准值,1倍增益
// 0x00000840 ADC2_DC0 校准值,2/3倍增益
// 0x00000844 ADC2_DC1 校准值,1倍增益
// 0x00000848 ADC2_AMC0 校准值,2/3倍增益
// 0x0000084C ADC2_AMC1 校准值,1倍增益
// 0x00000860 DAC 0选择 3.00V 档位,SYS_AFE_DAC_AMC 校准值(扩大 512 倍结果)
// 0x00000864 DAC 0选择 1.20V 档位,SYS_AFE_DAC_AMC 校准值(扩大 512 倍结果)
// 0x00000868 DAC 0选择 3.00V 档位,SYS_AFE_DAC_DC 校准值
// 0x0000086C DAC 0选择 1.20V 档位,SYS_AFE_DAC_DC 校准值
// 0x00000870 DAC 1选择 3.00V 档位,SYS_AFE_DAC_AMC 校准值(扩大 512 倍结果)
// 0x00000874 DAC 1选择 1.20V 档位,SYS_AFE_DAC_AMC 校准值(扩大 512 倍结果)
// 0x00000878 DAC 1选择 3.00V 档位,SYS_AFE_DAC_DC 校准值
// 0x0000087C DAC 1选择 1.20V 档位,SYS_AFE_DAC_DC 校准值
// 0x00000880 OPA0,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000884 OPA0,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000888 OPA0,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x0000088C OPA0,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000890 OPA0,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000894 OPA0,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008A0 OPA1,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008A4 OPA1,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008A8 OPA1,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008AC OPA1,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008B0 OPA1,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008B4 OPA1,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008C0 OPA2,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008C4 OPA2,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008C8 OPA2,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008CC OPA2,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008D0 OPA2,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008D4 OPA2,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008E0 OPA3,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008E4 OPA3,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008E8 OPA3,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008EC OPA3,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008F0 OPA3,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x000008F4 OPA3,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000900 OPA4,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000904 OPA4,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000908 OPA4,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x0000090C OPA4,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000910 OPA4,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000914 OPA4,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000920 OPA5,320K 欧姆 VS 05K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000924 OPA5,320K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000928 OPA5,160K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x0000092C OPA5,080K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000930 OPA5,040K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000934 OPA5,020K 欧姆 VS 10K 欧姆,GAIN 校准值(扩大 1000 倍结果),R0为0欧姆
// 0x00000940 温度传感器,斜率校准值
// 0x00000944 温度传感器,偏置校准值
// 0x00000950 OPA5,共模电压(扩大 1000 倍结果)
// 0x00000954 OPA4,共模电压(扩大 1000 倍结果)
// 0x00000958 OPA3,共模电压(扩大 1000 倍结果)
// 0x0000095C OPA2,共模电压(扩大 1000 倍结果)
// 0x00000960 OPA1,共模电压(扩大 1000 倍结果)
// 0x00000964 OPA0,共模电压(扩大 1000 倍结果)
// 0x00000A00 OPA0,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A04 OPA0,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A08 OPA0,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A0C OPA0,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A10 OPA0,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A14 OPA0,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A20 OPA1,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A24 OPA1,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A28 OPA1,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A2C OPA1,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A30 OPA1,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A34 OPA1,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A40 OPA2,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A44 OPA2,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A48 OPA2,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A4C OPA2,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A50 OPA2,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A54 OPA2,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A60 OPA3,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A64 OPA3,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A68 OPA3,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A6C OPA3,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A70 OPA3,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A74 OPA3,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A80 OPA4,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A84 OPA4,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A88 OPA4,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A8C OPA4,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A90 OPA4,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000A94 OPA4,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AA0 OPA5,320K 欧姆 VS 05K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AA4 OPA5,320K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AA8 OPA5,160K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AAC OPA5,080K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AB0 OPA5,040K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)
// 0x00000AB4 OPA5,020K 欧姆 VS 10K 欧姆挡位。高16位存放R2实际阻值,低16位存放R1实际阻值(扩大100 倍结果)

/**
 * @brief 读取MCU03的校准参数
 * @param addr 校准参数的地址
 */
uint32_t HAL_TRIM_Read(uint32_t addr)
{
    return HAL_TRIM_ReadMcu45(addr);
}

/**
 * @brief 读取芯片唯一ID
 * @param idx 0:ID0,1:ID1,2:ID2,3:ID3,4:ID4
 * @return 唯一ID
 */
uint32_t HAL_TRIM_ReadId(uint32_t idx)
{
    return HAL_TRIM_Read(0x0003FF60 + idx * 4);
}
/**
 * @brief 读取芯片唯一ID的CRC32值
 * @return 唯一ID的CRC32值
 * @note 相较于HAL_TRIM_ReadId，更方便存储和判断，但理论上存在重复的可能（1/0xffffffff）
 */
uint32_t HAL_TRIM_ReadIdCrc32(void)
{
    uint32_t id[5];
    for (int i = 0; i < 5; i++)
    {
        id[i] = HAL_TRIM_Read(0x0003FF60 + i * 4);
    }
    return HAL_CRC_Calc(HAL_CRC_0, HAL_CRC_MODEL_CRC32, (uint8_t *)id, sizeof(id));
}
